#### Terraform Validation & Plan Results
* Terraform Version 📎`1.10.3`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].time_rotating.rotating_current: Refreshing state... [id=2025-01-06T22:37:01Z][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_reader[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_developer[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_network_connectivity_config.network_connectivity_config: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5/da6e1a44-7e22-459d-b947-5b59b11e4aec][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_admin: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_reader[0]: Read complete after 2s [id=439960392122911][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_admin: Read complete after 2s [id=408985471222074][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_developer[0]: Read complete after 2s [id=66271379238954][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_consumption: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app_monitoring: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg][0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_engineering: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_storage: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_consumption.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-cnsmptn-dbac001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_action_group.monitor_action_group: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/actionGroups/mydlz01-dptest-prd-ag001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.databricks_access_connector.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-dptest-prd-dbac001][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.azuread_service_principal.service_principal: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.platform.azapi_update_resource.virtual_network: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_consumption_budget_subscription.consumption_budget_subscription: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Consumption/budgets/mydlz01-dptest-prd-bdgt][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.azuread_service_principal.service_principal: Read complete after 1s [id=/servicePrincipals/e73816f4-d36e-4271-8f9b-ad2752bdbfaf][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/abe21261-3577-fc10-aaa6-dd9f03bfcd17][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Read complete after 1s [id=/servicePrincipals/7f7c7b4a-704d-4531-b73e-45e16b388271][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_engineering.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-eng-dbac001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Read complete after 3s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/locations/northeurope][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_service_principal.service_principal: Refreshing state... [id=8089508589893950][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.databricksresourceprovider_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/e17d21ee-f4ad-5079-f944-293aeb68fa8b][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_activity_log_alert.monitor_activity_log_alert_service_health: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/activityLogAlerts/mydlz01-dptest-prd-alert-servicehealth][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dptest-prd-kv001-vault-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/d1b855da-305a-5cf7-4a21-6a1548acce4f][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgraw-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgraw-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/01da847e-7272-4d28-72ff-e187deed1e7d][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/4c849bc3-2246-af59-067a-6c78e94395ac][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/e1620d97-6da8-ffec-99ef-9e5a23be220c][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/2f85b378-ab85-abef-7e07-daea0177a46b][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-06T22:39:37Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-06T22:42:52Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-06T22:42:54Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-06T22:41:02Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_enriched: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_external_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/e034fc91-19ea-7ff3-8a00-8307b3240499][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_enriched_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/c6756f29-c97d-837a-7eb2-67eef15e5540][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_raw: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_curated: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_external: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_workspace_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/941961a8-a544-2163-cd72-578f0bce7676][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_curated_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/13436694-33a4-fa6c-83a9-3bda8cef81f9][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_raw_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/1da53266-750a-26ef-565f-7b886959e05a][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_directory.directory: Refreshing state... [id=/mydlz01-dptest-int][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permissions.permissions_directory_admin: Refreshing state... [id=/directories/1042334568870363][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permission_assignment.permission_assignment_reader[0]: Refreshing state... [id=439960392122911][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_workspace_conf.workspace_conf: Refreshing state... [id=_][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["access"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|access][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["query"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|query][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["marketplace"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|marketplace][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["storage"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|storage][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["lakeflow"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|lakeflow][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["serving"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|serving][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["billing"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|billing][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["compute"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|compute][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permission_assignment.permission_assignment_developer[0]: Refreshing state... [id=66271379238954][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permission_assignment.permission_assignment_service_principal: Refreshing state... [id=8089508589893950][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permission_assignment.permission_assignment_admin: Refreshing state... [id=408985471222074][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_cluster_policy.cluster_policy["DltComputePolicyPtt"]: Refreshing state... [id=000700BB1220F636][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-06T22:40:56Z][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_cluster_policy.cluster_policy["PersonalComputePolicyPtt"]: Refreshing state... [id=00136D1A89648C72][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_enriched_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/27765577-09aa-83be-d197-c267c7005210][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_cluster_policy.cluster_policy["JobComputePolicyPtt"]: Refreshing state... [id=0009EDE1B1D9A36B][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-dfs"]: Refreshing state... [id=da6e1a44-7e22-459d-b947-5b59b11e4aec/4f99de9b-d1e7-40c3-97eb-2bd781d0f760][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-dfs"]: Refreshing state... [id=da6e1a44-7e22-459d-b947-5b59b11e4aec/19b4ff54-86c8-44a9-bf59-48f6c8a49e23][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-blob"]: Refreshing state... [id=da6e1a44-7e22-459d-b947-5b59b11e4aec/1478ce98-592c-4952-a7c5-140270fcbdb2][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-blob"]: Refreshing state... [id=da6e1a44-7e22-459d-b947-5b59b11e4aec/3a046f04-7386-41d5-b63d-6213a3411e7d][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-dfs"]: Refreshing state... [id=da6e1a44-7e22-459d-b947-5b59b11e4aec/d9bc6e4c-9c76-4d50-8d92-5221268f6a6d][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-blob"]: Refreshing state... [id=da6e1a44-7e22-459d-b947-5b59b11e4aec/645b088a-543c-44e2-948b-e41a11754a1e][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-blob"]: Refreshing state... [id=da6e1a44-7e22-459d-b947-5b59b11e4aec/10c8ec25-a01f-4795-9974-16226e0ba84c][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-dfs"]: Refreshing state... [id=da6e1a44-7e22-459d-b947-5b59b11e4aec/b1e73151-0b89-4a4d-b0b9-04efe1cdf7f5][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-blob"]: Refreshing state... [id=da6e1a44-7e22-459d-b947-5b59b11e4aec/85ee7e5c-e877-4f88-aa92-ccf9f9dce3fd][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-dfs"]: Refreshing state... [id=da6e1a44-7e22-459d-b947-5b59b11e4aec/f1abd6b1-4d42-4edb-b500-fdb8ac6927b4][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-06T22:39:40Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_raw_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/19ff6f70-7be4-2b96-1751-501405052a21][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_curated_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/0b46b7b9-2cdf-2997-eb15-dcc18d71d6be][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_external_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/7968a9ce-6720-fb8d-e949-340fe119586d][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_binding.ncc_binding["consumption"]: Refreshing state... [id=3304021111593755/da6e1a44-7e22-459d-b947-5b59b11e4aec][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_binding.ncc_binding["engineering"]: Refreshing state... [id=831889593442656/da6e1a44-7e22-459d-b947-5b59b11e4aec][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_workspace_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/28a6ecd2-c9a3-a053-8863-f3b951df8e8a][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-06T22:39:57Z][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permissions.permissions_directory_developer: Refreshing state... [id=/directories/1042334568870363][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-06T22:40:18Z][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_budget.budget[0]: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5|d6587a21-54e9-4b4e-bf04-6a3390631370][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-blob"]: Refreshing state... [id=8832401990884005186][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-dfs"]: Refreshing state... [id=3387117204994982255][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-blob"]: Refreshing state... [id=4380306169161209224][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-blob"]: Refreshing state... [id=5112442823698277993][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-dfs"]: Refreshing state... [id=2198602079430042944][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-blob"]: Refreshing state... [id=5239035169996490202][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-blob"]: Refreshing state... [id=849274440648836136][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-dfs"]: Refreshing state... [id=636796568134460479][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-dfs"]: Refreshing state... [id=3545013594656401493][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-dfs"]: Refreshing state... [id=84074393384093314][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_secret_scope.secret_scope: Refreshing state... [id=mydlz01-dptest-int-secret-scope][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
  [31m-[0m destroy[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_catalog.catalog_external[0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "catalog_external" {
      [32m+[0m[0m comment                        = "Data Applicaton Catalog - dptest - External"
      [32m+[0m[0m enable_predictive_optimization = "DISABLE"
      [32m+[0m[0m force_destroy                  = true
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m isolation_mode                 = "OPEN"
      [32m+[0m[0m metastore_id                   = (known after apply)
      [32m+[0m[0m name                           = "mydlz01-dptest-int"
      [32m+[0m[0m owner                          = (known after apply)
      [32m+[0m[0m properties                     = {
          [32m+[0m[0m "app_name"    = "dptest"
          [32m+[0m[0m "costCenter"  = "ABCD1234"
          [32m+[0m[0m "environment" = "int"
          [32m+[0m[0m "location"    = "northeurope"
        }
      [32m+[0m[0m storage_root                   = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_catalog.catalog_internal[0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "catalog_internal" {
      [32m+[0m[0m comment                        = "Data Applicaton Catalog - dptest - Internal"
      [32m+[0m[0m enable_predictive_optimization = "DISABLE"
      [32m+[0m[0m force_destroy                  = true
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m isolation_mode                 = "ISOLATED"
      [32m+[0m[0m metastore_id                   = (known after apply)
      [32m+[0m[0m name                           = "mydlz01-dptest-int-int"
      [32m+[0m[0m owner                          = (known after apply)
      [32m+[0m[0m properties                     = {
          [32m+[0m[0m "app_name"    = "dptest"
          [32m+[0m[0m "costCenter"  = "ABCD1234"
          [32m+[0m[0m "environment" = "int"
          [32m+[0m[0m "location"    = "northeurope"
        }
      [32m+[0m[0m storage_root                   = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_curated[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_curated" {
      [32m+[0m[0m comment         = "Default curated storage layer for 'dptest' data application."
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-cur"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_enriched[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_enriched" {
      [32m+[0m[0m comment         = "Default enriched storage layer for 'dptest' data application."
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-enr"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-enr@mydlz01coreintstgenr.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_external[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_external" {
      [32m+[0m[0m comment         = "Default external storage layer for 'dptest' data application."
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-ext"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-ext@mydlz01coreintstgext.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_raw[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_raw" {
      [32m+[0m[0m comment         = "Default raw storage layer for 'dptest' data application."
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-raw"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-raw@mydlz01coreintstgraw.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_workspace[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_workspace" {
      [32m+[0m[0m comment         = "Default workspace storage layer for 'dptest' data application."
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-wks"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-wks@mydlz01coreintstgwks.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permissions.permissions_directory_admin[0m will be [1m[31mdestroyed[0m
  # (because databricks_permissions.permissions_directory_admin is not in configuration)
[0m  [31m-[0m[0m resource "databricks_permissions" "permissions_directory_admin" {
      [31m-[0m[0m directory_path = "/mydlz01-dptest-int" [90m-> null[0m[0m
      [31m-[0m[0m id             = "/directories/1042334568870363" [90m-> null[0m[0m
      [31m-[0m[0m object_type    = "directory" [90m-> null[0m[0m

      [31m-[0m[0m access_control {
          [31m-[0m[0m group_name       = "app001-admin" [90m-> null[0m[0m
          [31m-[0m[0m permission_level = "CAN_MANAGE" [90m-> null[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permissions.permissions_directory_developer[0m will be updated in-place
  # [0m(moved from module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permissions.permissions_directory_developer[0])
[0m  [33m~[0m[0m resource "databricks_permissions" "permissions_directory_developer" {
        id             = "/directories/1042334568870363"
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m access_control {
          [31m-[0m[0m group_name             = "app001-admin" [90m-> null[0m[0m
          [31m-[0m[0m permission_level       = "CAN_MANAGE" [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_MANAGE"
          [32m+[0m[0m service_principal_name = "app001-sp"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name       = "app001-admin"
          [32m+[0m[0m permission_level = "CAN_MANAGE"
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-developer"
          [32m+[0m[0m permission_level       = "CAN_MANAGE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-reader"
          [32m+[0m[0m permission_level       = "CAN_READ"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_storage_credential.storage_credential[0m will be created
[0m  [32m+[0m[0m resource "databricks_storage_credential" "storage_credential" {
      [32m+[0m[0m comment               = "Managed identity credential for 'dptest' Data Product"
      [32m+[0m[0m force_destroy         = true
      [32m+[0m[0m force_update          = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m isolation_mode        = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id          = (known after apply)
      [32m+[0m[0m name                  = "mydlz01-dptest-int-cred"
      [32m+[0m[0m owner                 = (known after apply)
      [32m+[0m[0m read_only             = false
      [32m+[0m[0m skip_validation       = false
      [32m+[0m[0m storage_credential_id = (known after apply)

      [32m+[0m[0m azure_managed_identity {
          [32m+[0m[0m access_connector_id = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-dptest-prd-dbac001"
          [32m+[0m[0m credential_id       = (known after apply)
        }

      [32m+[0m[0m databricks_gcp_service_account (known after apply)
    }

[1m  # module.data_landing_zone.module.core.module.databricks_workspace_engineering.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_databricks_workspace" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001"
    }

[1m  # module.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_databricks_workspace.databricks_workspace[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_databricks_workspace" "databricks_workspace" {
        id                                                  = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001"
        name                                                = "mydlz01-core-int-eng-dbw001"
      [33m~[0m[0m public_network_access_enabled                       = true [33m->[0m[0m false
        tags                                                = {}
        [90m# (21 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1mPlan:[0m 8 to add, 2 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>